<?php
require_once __DIR__ . '/vendor/autoload.php';

require_once 'smartAddress/DistinguishAddress.php';
require_once 'smartAddress/SmartAddress.php';


//$str = '湖北省武汉市东西湖区金银湖街道翠堤春晓四期31栋2单元13366712345 123456';
$arr = [
    'BRITAIN London  6 Westfield House, Cremorne Estate',
    '0674824038 SERREMONT FRANCE SERREMONT 8 IMPASSE DES LIERRERS 85700',
    '莫凡凡 0085256463833 新界 香港新界上水古洞路DD98，Lot50(古洞路105號－時昇路口轉上) 999077',
    '莫凡凡13822205128广东广州市海珠区广州宝岗大道可逸豪苑3栋7楼510000',
    '刘斌15373006988河北石家庄长安区河东街道和平路与胜利交叉口北行200米路东东胜集团050000',

    '张龙飞18633827015河北石家庄长安胜利北街19号 胜利北街与和平路交口北行200路东050047',

    '丁松15862613898江苏省苏州市张家港市金港镇德积长江东路232号215635',
    '杨赛玉13938287696河南省郑州市郑东新区普惠路29号海马公园五期6号楼501450000',
    '成济标13938210971河南省郑州市郑东新区中兴南路与福禄街交叉口嘉亿东方大厦1008号45000013938210971',
    '徐僮13582035931河北省石家庄市长安区和平路与胜利大街交口北行200米路东六层灰色小楼050000',
    '姓名：黎晓峰
    地址：重庆江北区内环以内重庆市渝北区黄山大道64号高科总部广场13号楼14层2号',
    '收货人: 搂实峰
    手机号码: 13883190402
    所在地区: 重庆重庆市渝中区大坪街道
    详细地址: 大坪支路18号英利国际4号楼',
    '唐先生15058859752浙江省宁波市鄞州区宁穿路1811号金融硅谷产业园区8号楼1402315000',
    '王晓春13655719552浙江省杭州市余杭区良渚文化村白鹭郡北42-101310000',
    '戴海丹13634241003浙江省温州市鹿城区府东路476号宏国大厦13楼325000',
    '孙维秀18866225806山东省青岛市李沧区黑龙江中路2648号 万福山庄小区21号楼2单元202266100',
    '戴敏华13818541214上海市上海市长宁区虹桥路2345号601室200336',
    '沈志杰17727485161广东省深罗湖区黄贝路2134号碧波花园8栋303518000',
    '王文15757899969浙江省嘉兴市海盐县西塘桥街道春风桃园售楼处三楼314300',
    '王见见13950005634福建省厦门市思明区湖明路莲景一里5号楼1404室361000',
    '张慧13714481262广东省深圳市宝安区深圳市宝安区西乡街道银田创意园37栋312518101',
    '方宇18048750172四川省凉山彝族自治州冕宁县人民路104号邮局615000',
    '盛存存15165372305山东省济宁市兖州市春都华府小区2号楼1单元601272113',
    '沈桃13880561122四川省成都市崇州市四川省崇州市杨祠街北五巷19号611230',
    '黄智飞15968525849浙江省金华市义乌市北下朱26栋一单元212321000',
    '弓海静15831502429河北省唐山市路南区唐宁湾102楼802063000',
    '谭海娟18673284888湖南省长沙市开福区伍家岭君悦香邸10栋402410000',
    '陈路13881810368四川省成都市温江区四川省 成都市 温江区 柳城街道 凤溪大道中段95号611130',
    '俞卫红13859092891福建省福州市台江区茶亭世贸臻园1号楼1302350000',
    '兰亮荣13688078356四川省成都市新都区蜀龙路198号保利198公园蔷薇郡5栋610504',
    '张志秀13784463889河北省廊坊市三河市燕郊行宫西大街二十号怡园别墅寿6号065000',
    '陈斯妮15900080366广东省中山市中山市火炬开发区南外环路8号凯茵新城01区挪威森林H5栋2105房528400',
    '华丽13738188465浙江省杭州市萧山区闻堰镇聚望名座1-1-302310000',
    '方华科13905863736浙江省台州市温岭市城北街道双莲路78号恒辉鞋业317500',
    '吕春华13705313989山东省济南市槐荫区美里湖新沙工业区北区四街11号250118',
    '于莉莉15957271618浙江省湖州市吴兴区龙溪街道 新竹路36号中南大厦A座18楼1806(浙江管理咨询有限公司）313000',
    '郭丽丽18851519006浙江省杭州市余杭区文一西路969号6号小邮局310000',
    '李荣荣13176538082山东省青岛市市北区滨县路59号金色年华6号楼804266000',
    '廖媛13980284406四川省凉山彝族自治州冕宁县泸沽镇小区615000',
    '张蕾15010019542北京市北京市海淀区复兴路20号院100000',
    '黄宇15605917110福建省福州市晋安区晋连路240号双星公寓2#808350011',
    '屠烨卿13486667080浙江省宁波市余姚市余姚市富巷北路558号三楼紫金保险315409',
    '梁英13777862525浙江省杭州市余杭区余杭镇新明半岛涵碧园4-3311121',
    '曹冬梅13624432033吉林省延边朝鲜族自治州图们市吉林省图们市金盾家园超市，133100',
    '周霞15873649948湖南省常德市汉寿县西湖管理区水利局415000',
    '曹冬梅13624432033吉林省延边朝鲜族自治州图们市吉林省图们市金盾家园超市，133100',
    '骆彬彬13721118311安徽省合肥市蜀山区习友路和潜山路交口华润凯旋门二期7＃3002230000',
    '赵懿17830451468重庆市重庆市渝中区长江中路174号龙湖时代天街11栋400000',
    '周晓平18981776170四川省成都市武侯区火车南站街道桐梓林东路1号世纪锦苑10幢610000',
    '王后生13905285019江苏省镇江市扬中市明珠园山庄2弄5号212000',
    '熊梓宏17318989656四川省成都市龙泉驿区北泉路188号玺印上院610000',
    '赵雪存13594021625重庆市重庆市九龙坡区杨家坪直港大道天宝路10号400000',
    '伍嘉荣15917875246上海市上海市虹口区花园路128号2街区A座331室200000',
    '张峥峥13984086709贵州省贵阳市观山湖区观山湖一号9栋11楼550023',
    '李祥宏18813222100广东省湛江市徐闻县东方四路人民银行旁顺丰快递收524000',
    '康玉坤13031483666海南省海口市秀英区西秀镇长滨四路11号阳光丁香园C栋二单元1201570100',
    '谭皓月18623696609重庆市重庆市荣昌县金科二期22号附13号（百世快递对面，请不要放百世快递）谭女士400000',
    '于春梅13998696577辽宁省大连市金州区斯大林路526号15楼116000',
    '盛飞15255309966安徽省芜湖市镜湖区天门山服务中心弋矶山公共服务中心天门山西路95号赤铸山庄小区4栋1单元401室241000',
    '陈琼13862009088江苏省苏州市姑苏区工业园区东华林街118号仁恒双湖湾1期10幢204215000',
    '余秋贝18981811967四川省成都市龙泉驿区公园路二段89号余恩勤代收610100',
    '黄宏13802870413广东省惠州市惠城区东湖花园五号小区515栋2单元12楼B 宏雪英代收516000',
    '彭婉18857485487浙江省宁波市慈溪市周巷镇天元周浒公路878支路56号祥合金电子315300',
    '罗观17512566175四川省成都市成华区建材路29号隆鑫九熙一期3栋610000',
    '赵霜13547932688四川省成都市郫县安靖镇喜安小区喜安之星幼儿园旁610000',
    '郑健怡13802410010广东省广州市越秀区中山三路 33 号中华广场中华国际写字楼 B 座 1706 室510000',
    '吴丽萍13918722552上海市上海市宝山区联谊路619弄建发央玺301号302室200000',
    '肖洋希13880233069四川省成都市武侯区浆洗街5号附二号橄榄苑610000',
    'SHI GUIZHI13159630208吉林省延边朝鲜族自治州汪清县大兴沟林业局站前八号楼133000',
    '霍淑梅18537679311广东省惠州市惠阳区秋长街道光耀城5期2栋706房516221',
    '朱容香13905773405浙江省温州市鹿城区茶院小区2幢403室325000',
    '杨海英18087732109云南省普洱市墨江哈尼族自治县联珠镇回归社区对尼一组665000',
    '杨先生15626059852广东省广州市南沙区凤凰大道中龙光棕榈水岸二期3903510000',
    '徐宇航13810058707上海市上海市浦东新区中国上海市浦东新区崂山路600号长河国际公寓22A1200120',
    '岳毅19928807061广东省深圳市宝安区福永镇福永花苑C2-301518000',
    '孙玉华18340458497辽宁省本溪市明山区水塔路71栋3-2-6117000',
    '肖薇15173266631湖南省长沙市岳麓区绿地中央广场8栋410000',
    '杨瑞霞15958503990浙江省绍兴市诸暨市东旺路206号市检察院311800',
    '雍祥臻18180520880广东省广州市黄埔区开创大道保利林语山庄林居二街3号楼6F905 丁敏代收510530',
    '杨锐15997330014上海市上海市金山区蒙山路1498号三岛龙洲苑21栋602200000',
    '庆华18648360005内蒙古自治区鄂尔多斯市康巴什区锦绣山庄18号楼2单元108017000',
];

//dump(explode('重庆', $str));
try {
    //code...
    $address = new SmartAddress();
    //echo '<pre>'; var_dump($address->getRegions());
    array_map(function($item) use($address) {
        dump($item, $address->analysis($item));
    }, $arr);

} catch (\Throwable $th) {
    echo $th->getMessage();
}
//$address = new DistinguishAddress();